; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	image3 - mode
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star6 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Star12)
	(have_image Star10 image3)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 infrared0)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon15 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon15 instrument4 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon13 instrument4 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (take_image satellite1 phenomenon11 instrument4 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 8
12. (turn_to satellite0 star10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star10)
   goals met: 3 of 8
13. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 4 of 8
14. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
15. (take_image satellite0 star14 instrument0 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 5 of 8
16. (turn_to satellite0 star5 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star5)
   goals met: 6 of 8
17. (turn_to satellite1 star12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star12)
   goals met: 7 of 8
18. (take_image satellite1 star12 instrument4 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 8 of 8
